#include<stdio.h>

//运算符，双目运算符（+-*/），单目运算符(++,--)，三目(?:)。。。

int main()
{
    //复合运算符
    // int a;
    // a+=3;相当于a=a+3
    // a*=6+8;a=a*(6+8)

    int a=40;
    int b=6;
    printf("%d + %d = %d\n",a,b,a+b);
    printf("%d - %d = %d\n",a,b,a-b);
    printf("%d * %d = %d\n",a,b,a*b);
    printf("%d / %d = %d\n",a,b,a/b);
    printf("%d %% %d = %d\n",a,b,a%b);//取余，printf如果要输出%，则需要使用%%

    float m=10.32;
    float n=4.5;
    printf("%.4f + %.4f = %.4f\n",m,n,m+n);
    printf("%.4f - %.4f = %.4f\n",m,n,m-n);
    printf("%.4f * %.4f = %.4f\n",m,n,m*n);
    printf("%.4f / %.4f = %.4f\n",m,n,m/n);
    //注意只有整数能够取余运算%，浮点型不行
    //printf("%.4f %% %.4f = %.4f\n",m,n,m%n);

    ///关系运算符：> < >= <= == !=
    int x= 10>5;
    int y= 10<5;
    printf("x= %d, y= %d\n",x,y);///输出非0即为真，为0即为假

    //逻辑运算符： 逻辑与&& 逻辑或|| 逻辑非!
    //注意，逻辑与和逻辑或的短路原则
    //第一个表达式为假，则逻辑与的整体表达式为假，后表达式不运算
    //第一个表达式为真，则逻辑或的整体表达式为真，后表达式运算

    //位运算符 与& 或| 取反~ 异或^ 位移<<,>>
    //右移分为逻辑右移和算数右移
    //逻辑右移：高位补0，低位溢出
    //算数右移：高位补符号位，低位溢出
    printf("%d\n",-1>>3);//-1>>3还是-1

    //条件运算符A？B:C
    //表示如果A为真，则执行B的结果；如果A为假，则执行C的结果
    //等价于if(A){B;}else{C;}
    a=10;
    b=20;
    int c=(a>b)?(a+=10):(b+=10);
    printf("c=%d\n",c);//c=b+=10
    printf("a=%d,b=%d\n",a,b);//b+=10执行

    //逗号运算符D=(A,B,C)
    //先运行A,再运行B，最后运行C，最终变量D的值为表达式C的值
    a=10;b=20;
    c=(a+=10,b+=10,a+=b);
    printf("a=%d,b=%d,c=%d\n",a,b,c);//a=50,b=30,c=50

    //自增自减运算符++ --
    //放在后面，先使用，后自增减
    a=100;
    b=a++;
    printf("a=%d,b=%d\n",a,b);//a=101,b=100
    //放在前面，先自增减，后使用
    a=100;
    b=++a;
    printf("a=%d,b=%d\n",a,b);//a=101,b=101





    return 0;
}