#include<stdio.h>

int main()
{
    ////数组名a就是地址，但a是个常量不能赋值，p是变量可以赋值
    // int a[10]={1,2,3,4,5,6,7,8,9,0};
    // int *p;
    // p=a;
    // printf("%d %d\n",a,p);
    // printf("%d %d\n",*a,*p);

    printf("******************************\n");

    //通过指针运算加取值的方法来引用数组的元素
    // int a[10];
    // int *p;
    // p=a;
    // *(p+2)=100;//相当于a[2]=100,    p+2相当于p从0向后移了2个位置
    // printf("%d\n",a[2]);

    printf("******************************\n");

    //只要将数组名赋值给同类的指针变量，则该指针变量与数组名可以用相同的方法操作数组
    int a[5]={0,1,2,3,4};
    int *p;
    p=a;
    printf("a[2]=%d\n",a[2]);
    printf("p[2]=%d\n",p[2]);

    printf("*(a+2)=%d\n",*(a+2));
    printf("*(p+2)=%d\n",*(p+2));

    printf("p=%p\n",p);
    printf("p+2=%p\n",p+2);
    printf("&a[0]=%p\n",&a[0]);
    printf("&a[2]=%p\n",&a[2]);
    return 0;
}